<a href="https://colab.research.google.com/github/brendanpshea/database_class/blob/main/Lab_Basic_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Lab Directions
For this lab, you'll be writing some basic SQL queries. Here is what you need to do:

1. "OPEN" this lab in "Google Colab" and proceed to set up afree Google Colab account if you nned to: https://colab.research.google.com/. 
2. Save a copy of this lab to your Colab account. You'll want to connect to a "runtime".
3. Work on the lab! To run code cells, you just need to click "Ctrl + Enter." To edit cells, you can double click on the them.
4. When you are done working on the lab, click on "File: Download" and choose the option to download it as .ipynb.
5. Submit this file to D2L.

Oh, and make sure to put your name here:

NAME(s):

---

#Problem 0: Run the cells below
The following two cells  will get the Movie database set up. After you've run these cells (by hitting Ctrl + Enter), you should see the relational schema for each of the Movie databse tables.

Note: The first time you run these cells, it may take a minute or two!

In [1]:
# Some UNIX utilites we need to install for the lab.
!pip install wget --quiet
!pip install sqlalchemy --quiet
!pip install ipython-sql --quiet

# Now let's download the file we'll be using for this lab
!wget 'https://github.com/brendanpshea/database_class/raw/main/movie.sqlite' -q

# Let's make a connnection with the database
%load_ext sql
%sql sqlite:////content/movie.sqlite

  Building wheel for wget (setup.py) ... done

'Connected: @/content/movie.sqlite'

In [2]:
# Get the schema
%%sql 
SELECT name as "Table Name", sql as "Schema of Table" FROM sqlite_master where type = 'table';

 * sqlite:////content/movie.sqlite
Done.

[('Movie', 'CREATE TABLE Movie (id CHAR(7) PRIMARY KEY, name VARCHAR(64), year INTEGER, rating VARCHAR(5), runtime INTEGER, genre VARCHAR(16), earnings_rank INTEGER)'),
 ('Person', 'CREATE TABLE Person (id CHAR(7) PRIMARY KEY, name VARCHAR(64), dob DATE, pob VARCHAR(128))'),
 ('Actor', 'CREATE TABLE Actor (actor_id CHAR(7), movie_id CHAR(7), PRIMARY KEY (actor_id, movie_id), FOREIGN KEY (actor_id) REFERENCES Person(id), FOREIGN KEY (movie_id) REFERENCES Movie(id))'),
 ('Director', 'CREATE TABLE Director(director_id CHAR(7), movie_id CHAR(7), PRIMARY KEY (director_id, movie_id), FOREIGN KEY (director_id) REFERENCES Person(id), FOREIGN KEY (movie_id) REFERENCES Movie(id))'),
 ('Oscar', 'CREATE TABLE Oscar(movie_id CHAR(7), person_id CHAR(7), type VARCHAR(23), year INTEGER, PRIMARY KEY (person_id, type, year), FOREIGN KEY (movie_id) REFERENCES Movie(id), FOREIGN KEY (person_id) REFERENCES Person(id)\n)')]

In [39]:
# Show the first 5 rows of each table
movie_df = %sql SELECT * FROM Movie LIMIT 5;
person_df = %sql SELECT * FROM Person LIMIT 5;
actor_df = %sql SELECT * FROM Actor LIMIT 5;
director_df = %sql SELECT * FROM Director LIMIT 5;
oscar_df = %sql SELECT * FROM Oscar LIMIT 5;
print(movie_df,'\n\n',person_df, '\n\n', actor_df, '\n\n', director_df, '\n\n', oscar_df)

 * sqlite:////content/movie.sqlite
Done.
 * sqlite:////content/movie.sqlite
Done.
 * sqlite:////content/movie.sqlite
Done.
 * sqlite:////content/movie.sqlite
Done.
 * sqlite:////content/movie.sqlite
Done.
+---------+------------------------------+------+--------+---------+-------+---------------+
|    id   |             name             | year | rating | runtime | genre | earnings_rank |
+---------+------------------------------+------+--------+---------+-------+---------------+
| 2488496 | Star Wars: The Force Awakens | 2015 | PG-13  |   138   |   A   |       1       |
| 4154796 |      Avengers: Endgame       | 2019 | PG-13  |   181   |  AVS  |       2       |
| 0499549 |            Avatar            | 2009 | PG-13  |   162   |  AVYS |       3       |
| 1825683 |        Black Panther         | 2018 | PG-13  |   134   |  AVS  |       4       |
| 4154756 |    Avengers: Infinity War    | 2018 | PG-13  |   149   |  AVYS |       5       |
+---------+------------------------------+------+--------+---------+-------+---------------+

 +---------+-----------------+------------+-------------------------+
|    id   |       name      |    dob     |           pob           |
+---------+-----------------+------------+-------------------------+
| 0000002 |  Lauren Bacall  | 1924-09-16 | New York, New York, USA |
| 0000004 |   John Belushi  | 1949-01-24 |  Chicago, Illinois, USA |
| 0000006 |  Ingrid Bergman | 1915-08-29 |    Stockholm, Sweden    |
| 0000007 | Humphrey Bogart | 1899-12-25 | New York, New York, USA |
| 0000008 |  Marlon Brando  | 1924-04-03 |   Omaha, Nebraska, USA  |
+---------+-----------------+------------+-------------------------+

 +----------+----------+
| actor_id | movie_id |
+----------+----------+
| 0000138  | 0120338  |
| 0000701  | 0120338  |
| 0000708  | 0120338  |
| 0000870  | 0120338  |
| 0000200  | 0120338  |
+----------+----------+

 +-------------+----------+
| director_id | movie_id |
+-------------+----------+
|   0000116   | 0120338  |
|   0000184   | 0076759  |
|   0011470   | 0298148  |
|   0000229   | 0083866  |
|   0000184   | 0120915  |
+-------------+----------+

 +----------+-----------+-------------------------+------+
| movie_id | person_id |           type          | year |
+----------+-----------+-------------------------+------+
| 6751668  |    None   |       BEST-PICTURE      | 2020 |
| 7286456  |  0001618  |        BEST-ACTOR       | 2020 |
| 7549996  |  0000250  |       BEST-ACTRESS      | 2020 |
| 7131622  |  0000093  |  BEST-SUPPORTING-ACTOR  | 2020 |
| 7653254  |  0000368  | BEST-SUPPORTING-ACTRESS | 2020 |
+----------+-----------+-------------------------+------+

In [41]:
%%sql
--feel free to type some queries here (and the run them) to see how they work!
--You should only write ONE query per cell.

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

# Problem 1
Retrieve the first 8 rows in the Oscar table ordered by Oscar type. Hint: You'll need to use SELECT, FROM, ORDER BY, and LIMIT. You'll want to retrieve all attributes using *.

In [26]:
%%sql
--Your code here

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

#Problem 2
Retrieve a list of the different "types" of awards that are listed in the Oscar table. Hint: use DISTINCT.

In [25]:
%%sql
--Your code here

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

#Problem 3
Retrieve the number of distinct directors that are represented in the Director table. Hint, you'll neeed to use both COUNT and DISTINCT. You only want each "director_id" to be counted once.

In [24]:
%%sql
--Your code here

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

#Problem 4
Retrieve the name and release year of movies that start with the word 'Captain.'

In [23]:
%%sql
--Your code here

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

#Problem 5
Retrieve the name and place of birth of all Persons born in "Minnesota, USA". Order them in descending order by name.

In [22]:
%%sql
--Your code here

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

#Problem 6
Retrieve the names and release years of movies that have won a 'Best Picture' Oscar. Limit the results to 10. Hint: You'll need to JOIN Oscar and Movie using Oscar.movie_id and Movie.id. You'll also need to think about Oscar.type and Movie.year.

In [21]:
%%sql
--Your code here

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

#Problem 7
Retrieve the names of all Persons who have won a 'BEST-ACTRESS' award since 1990. Hint: You'll need to JOIN Persons with Oscar.

In [19]:
%%sql
--Your code here

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

#Problem 8
Retrieve the COUNT of actors who appeared in a film in 2012. Name this column that is returned "2012 Actors." Hint: You'll need to JOIN Actor with Movie. And rememember to count only "distinct" actor_ids (since some actors will have appeared in multiple movies).

In [20]:
%%sql
--Your code here

 * sqlite:////content/movie.sqlite
0 rows affected.

[]

#Problem 9
Retrieve the total running time of all of the films that Bill Murray has appeared in. Express this is "number of days." (So, you need to convert somehow take the sum of the runtimes, and then convert minutes to days).

In [ ]:
%%sql
--Your code here

#Problem 10
Retrieve the names of films that have have a person with a first name starting with "WIll" as director or an actor. Hint: You'll be doing two "select" statements with a UNION in the middle of them.

In [64]:
%%sql
--Your code here

 * sqlite:////content/movie.sqlite
0 rows affected.

[]